:PROPERTIES:
:ID:       ecfa4e3b-2190-4be9-b8af-2e7407d7e26c
:END:
#+TITLE: Emacs: checking a coredump with gdb
#+CATEGORY: slips
#+TAGS:

*** Process coredump

Get info about last coredump

#+begin_src sh :results output table
emacspid="$(lastcore | tr -d '\"')"

# ok this is crazy
nlines="$(coredumpctl info $emacspid --no-pager | cut -d':' -f1 | grep -ne "Message" | cut -d':' -f1)"

coredumpctl info $emacspid --no-pager | head -n$nlines

#+end_src

#+RESULTS:
| PID:        | 4052937                                                                                   | (.emacs-29.0.92-)                                                          |                   |     |      |       |        |       |
| UID:        | 1000                                                                                      | (dc)                                                                       |                   |     |      |       |        |       |
| GID:        | 1000                                                                                      | (dc)                                                                       |                   |     |      |       |        |       |
| Signal:     | 11                                                                                        | (SEGV)                                                                     |                   |     |      |       |        |       |
| Timestamp:  | Thu                                                                                       | 2023-09-21                                                                 | 13:18:05          | EDT | (4h  | 41min | ago)   |       |
| Command     | Line:                                                                                     | /gnu/store/lcf4xm3jaj7pkfg0h23h5y8946syrwfc-profile/bin/emacs              | --fg-daemon       |     |      |       |        |       |
| Executable: | /gnu/store/ip70sppv1xkgvf2ssms5arkaa40r5zba-emacs-next-pgtk-29.0.92/bin/.emacs-29.0.92-real |                                                                            |                   |     |      |       |        |       |
| Control     | Group:                                                                                    | /user.slice/user-1000.slice/user@1000.service/app.slice/gmacs-arch.service |                   |     |      |       |        |       |
| Unit:       | user@1000.service                                                                         |                                                                            |                   |     |      |       |        |       |
| User        | Unit:                                                                                     | gmacs-arch.service                                                         |                   |     |      |       |        |       |
| Slice:      | user-1000.slice                                                                           |                                                                            |                   |     |      |       |        |       |
| Owner       | UID:                                                                                      | 1000                                                                       | (dc)              |     |      |       |        |       |
| Boot        | ID:                                                                                       | cb39ebcaa6434eaab0464cc11b587496                                           |                   |     |      |       |        |       |
| Machine     | ID:                                                                                       | bb2e37c388884959b04f1d829e8de787                                           |                   |     |      |       |        |       |
| Hostname:   | kratos                                                                                    |                                                                            |                   |     |      |       |        |       |
| Storage:    | /var/lib/systemd/coredump/core.\x2eemacs-29\x2e0\x2e92-.1000.cb39ebcaa6434eaab0464cc11b587496.4052937.1695316685000000.zst | (present)                                                                  |                   |     |      |       |        |       |
| Size        | on                                                                                        | Disk:                                                                      | 70.5M             |     |      |       |        |       |
| Message:    | Process                                                                                   | 4052937                                                                    | (.emacs-29.0.92-) | of  | user |  1000 | dumped | core. |

Extract coredump. The =emacs_desktop= variable will be incorrect once you
restore.

#+begin_src sh :results output :var desktop_lock=(desktop-full-lock-name)
emacspid="$(lastcore | tr -d '\"')"
emacscoredumps=/data/dev/emacsdumps

# lastcore output is still quoted
[ -f "$desktop_lock" ] \
    && [ $emacspid -eq "$(cat $desktop_lock)" ] \
           || echo coredumpctl dump "$emacspid" --output "$emacscoredumps/emacs-$(date +%Y-%m_%d-%H-%M).core"

# TODO: change to set to the coredump timestamp
#+end_src

#+RESULTS:
: coredump dump 4052937 --output /data/dev/emacsdumps/emacs-2023-09_21-17-44.core

Check binary for debugging symbols.

#+begin_src sh
objdump --syms $GUIX_EXTRA/emacs-g/emacs-g/bin/.emacs-29.0.92-real
#+end_src

